# ShowClass

## Description
Sets the visibility of the specified class to normal (visible) status.

```pascal
PROCEDURE ShowClass(className : STRING);
```

```python

def vs.ShowClass(className):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Name of class.|

## Examples
```pascal
ShowClass('Dimension');

```

## See Also
VS Functions:
HideClass

## Version
Availability: from MiniCAD
## Category
* Classes